# BuiltInFailures.PathFailures Class

---
Failures about Path.
SystemObject Autodesk.Revit.DBBuiltInFailuresPathFailures
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class PathFailures

    Public NotInheritable Class PathFailures

    public ref class PathFailures abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type PathFailures = class end
The BuiltInFailuresPathFailures type exposes the following members.
| Name| Description
---|---|---
| Path3dRegenError|  Picked Path could not be regenerated.
Top
#### Reference
Autodesk.Revit.DB Namespace